##
## Арифметические операторы
##
x = 15
y = 4

x + y     # x + y = 19
x - y     # x - y = 11
x * y     # x * y = 60
x / y     # x / y = 3.75
x // y    # x // y = 3
x ** y    # x ** y = 50625

##
## Операторы сравнения
##
x = 10
y = 12

x > y     # x > y — False
x < y     # x < y — True
x == y    # x == y — False
x != y    # x != y — True
x >= y    # x >= y — False
x <= y    # x <= y — True


##
## Логические операторы
##
x = True
y = False

x and y     # not x
x or y      # x or y — True
not x       # not x — False

##
## Побитовые операторы
##
x = 10  # 00001010
y = 4   # 00000100

x & y   # x & y = 0 (00000000)
x | y   # x | y = 14 (00001110)
~x      # ~x = -11 (11110101)
x ^ y   # x ^ y = 14 (00001110)
x >> 2  # x >> 2 = 2 (00000010)
x << 2  # x << 2 = 40 (00101000)

##
## Операторы присваивания
##
x = 5
x += 5      # x = x + 5
x -= 5      # x = x - 5
x *= 5      # x = x * 5
x /= 5      # x = x / 5
x %= 5      # x = x % 5
x //= 5     # x = x // 5
x **= 5     # x = x ** 5
x &= 5      # x = x & 5
x |= 5      # x = x | 5
x ^= 5      # x = x ^ 5
x >>= 5     # x = x >> 5
x <<= 5     # x = x << 5

## 
## Операторы тождественности
##
x1 = 5
y1 = 5

x1 is not y1    # False
x1 is y1        # True


##
## Операторы принадлежности
##
x = 'Привет, мир'

'П' in x            # True
'привет' not in x   # True